Tekla Open API Reference for Tekla Structures 2025
CatalogHandler.GetLibraryProfileItems Method
 Returns an enumerator of library profile items.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ProfileItemEnumerator GetLibraryProfileItems()
Public Function GetLibraryProfileItems As ProfileItemEnumerator
Return Value
Type: ProfileItemEnumerator
A ProfileItemEnumerator of library profile items.
See Also
Reference
CatalogHandler Class
Tekla.Structures.Catalogs Namespace